apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g4xxxx_rcc.h
#define RCC_ICSCR_HSITRIM_SHIFT        (24)                /* Bits 30-24: HSI16 clock trimming */
#define RCC_ICSCR_HSITRIM_MASK         (0x7f << RCC_ICSCR_HSITRIM_SHIFT)
#define RCC_ICSCR_HSITRIM_RESET        (0x40 << RCC_ICSCR_HSITRIM_SHIFT)

/* CFGR - Clock Configuration Register */

#define RCC_CFGR_SW_SHIFT              (0)                 /* Bits 1-0: System clock switch */
#define RCC_CFGR_SW_MASK               (0x3 << RCC_CFGR_SW_SHIFT)
#  define RCC_CFGR_SW_HSI              (1 << RCC_CFGR_SW_SHIFT)
#  define RCC_CFGR_SW_HSE              (2 << RCC_CFGR_SW_SHIFT)
#  define RCC_CFGR_SW_PLL              (3 << RCC_CFGR_SW_SHIFT)
#define RCC_CFGR_SWS_SHIFT             (2)                 /* Bits 3-2: System clock switch status */
#define RCC_CFGR_SWS_MASK              (0x3 << RCC_CFGR_SWS_SHIFT)
#  define RCC_CFGR_SWS_HSI             (1 << RCC_CFGR_SWS_SHIFT)
#  define RCC_CFGR_SWS_HSE             (2 << RCC_CFGR_SWS_SHIFT)
#  define RCC_CFGR_SWS_PLL             (3 << RCC_CFGR_SWS_SHIFT)
#define RCC_CFGR_HPRE_SHIFT            (4)                 /* Bits 7-4: AHB prescaler */
#define RCC_CFGR_HPRE_MASK             (0xf << RCC_CFGR_HPRE_SHIFT)
#  define RCC_CFGR_HPRE_SYSCLK         (0 << RCC_CFGR_HPRE_SHIFT)
#  define RCC_CFGR_HPRE_SYSCLKd2       (8 << RCC_CFGR_HPRE_SHIFT)
#  define RCC_CFGR_HPRE_SYSCLKd4       (9 << RCC_CFGR_HPRE_SHIFT)
#  define RCC_CFGR_HPRE_SYSCLKd8       (10 << RCC_CFGR_HPRE_SHIFT)
#  define RCC_CFGR_HPRE_SYSCLKd16      (11 << RCC_CFGR_HPRE_SHIFT)
#  define RCC_CFGR_HPRE_SYSCLKd64      (12 << RCC_CFGR_HPRE_SHIFT)
#  define RCC_CFGR_HPRE_SYSCLKd128     (13 << RCC_CFGR_HPRE_SHIFT)
#  define RCC_CFGR_HPRE_SYSCLKd256     (14 << RCC_CFGR_HPRE_SHIFT)
#  define RCC_CFGR_HPRE_SYSCLKd512     (15 << RCC_CFGR_HPRE_SHIFT)
#define RCC_CFGR_PPRE1_SHIFT           (8)                 /* Bits 10-8: AHB1 prescaler */
#define RCC_CFGR_PPRE1_MASK            (0x7 << RCC_CFGR_PPRE1_SHIFT)
#  define RCC_CFGR_PPRE1_HCLK          (0 << RCC_CFGR_PPRE1_SHIFT)
#  define RCC_CFGR_PPRE1_HCLKd2        (4 << RCC_CFGR_PPRE1_SHIFT)
#  define RCC_CFGR_PPRE1_HCLKd4        (5 << RCC_CFGR_PPRE1_SHIFT)
#  define RCC_CFGR_PPRE1_HCLKd8        (6 << RCC_CFGR_PPRE1_SHIFT)
#  define RCC_CFGR_PPRE1_HCLKd16       (7 << RCC_CFGR_PPRE1_SHIFT)
#define RCC_CFGR_PPRE2_SHIFT           (11)                /* Bits 13-11: AHB2 prescaler */
#define RCC_CFGR_PPRE2_MASK            (0x7 << RCC_CFGR_PPRE2_SHIFT)
#  define RCC_CFGR_PPRE2_HCLK          (0 << RCC_CFGR_PPRE2_SHIFT)
#  define RCC_CFGR_PPRE2_HCLKd2        (4 << RCC_CFGR_PPRE2_SHIFT)
#  define RCC_CFGR_PPRE2_HCLKd4        (5 << RCC_CFGR_PPRE2_SHIFT)
#  define RCC_CFGR_PPRE2_HCLKd8        (6 << RCC_CFGR_PPRE2_SHIFT)
#  define RCC_CFGR_PPRE2_HCLKd16       (7 << RCC_CFGR_PPRE2_SHIFT)
                                                           /* Bits 23-14: Reserved */
#define RCC_CFGR_MCOSEL_SHIFT          (24)                /* Bits 27-24: MCU clock output*/
#define RCC_CFGR_MCOSEL_MASK           (0xf << RCC_CFGR_MCOSEL_SHIFT)
#define RCC_CFGR_MCOPRE_SHIFT          (28)                /* Bit 28: */
#define RCC_CFGR_MCOPRE_MASK           (0x7 << RCC_CFGR_MCOPRE_SHIFT)
                                                           /* Bit 31: Reserved */

#define RCC_CFGR_RESERVED_MASK         0x00ffc000          /* Bits 23-14 should be kept at reset value */
#define RCC_CFGR_RESET                 0x00000001          /* It's actually 0x5 but bits 3-2 are read only */

/* PLLCFGR - System PLL Configuration Register */

#define RCC_PLLCFGR_PLLSRC_SHIFT       (0)                 /* Bits 1-0: Main PLL entry clock source */
#define RCC_PLLCFGR_PLLSRC_MASK        (3 << RCC_PLLCFGR_PLLSRC_SHIFT)
#  define RCC_PLLCFGR_PLLSRC_NOCLK     (0 << RCC_PLLCFGR_PLLSRC_SHIFT)
#  define RCC_PLLCFGR_PLLSRC_HSI       (2 << RCC_PLLCFGR_PLLSRC_SHIFT)
#  define RCC_PLLCFGR_PLLSRC_HSE       (3 << RCC_PLLCFGR_PLLSRC_SHIFT)
                                                           /* Bits 3-2: Reserved */
#define RCC_PLLCFGR_PLLM_SHIFT         (4)                 /* Bits 7-4: Division factor M of main PLL input clock */
#define RCC_PLLCFGR_PLLM_MASK          (0xf << RCC_PLLCFGR_PLLM_SHIFT)
#define RCC_PLLCFGR_PLLM(n)            ((((n) - 1) << RCC_PLLCFGR_PLLM_SHIFT) & RCC_PLLCFGR_PLLM_MASK) /* n=1..16 */

#define RCC_PLLCFGR_PLLN_SHIFT         (8)                 /* Bits 14-8: Main PLL multiplication factor N for VCO, n=8..127 */
#define RCC_PLLCFGR_PLLN_MASK          (0x7f << RCC_PLLCFGR_PLLN_SHIFT)
#define RCC_PLLCFGR_PLLN(n)            (((n) << RCC_PLLCFGR_PLLN_SHIFT) & RCC_PLLCFGR_PLLN_MASK)
                                                           /* Bit 15: Reserved */
#define RCC_PLLCFGR_PLLPEN             (1 << 16)           /* Bit 16: Main PLL PCLK output enable */
#define RCC_PLLCFGR_PLLP               (1 << 17)           /* Bit 17: Main PLL division factor for PLL P clock, 0:PLLP=7, 1:PLLP=17 */
                                                           /* Bits 19-18: Reserved */
#define RCC_PLLCFGR_PLLQEN             (1 << 20)           /* Bit 20: Main PLL Q clock output enable */
#define RCC_PLLCFGR_PLLQ_SHIFT         (21)                /* Bits 22-21: Main PLL division factor for PLL Q clock */
#define RCC_PLLCFGR_PLLQ_MASK          (0x3 << RCC_PLLCFGR_PLLQ_SHIFT)
#  define RCC_PLLCFGR_PLLQ_2           (0x0 << RCC_PLLCFGR_PLLQ_SHIFT)
#  define RCC_PLLCFGR_PLLQ_4           (0x1 << RCC_PLLCFGR_PLLQ_SHIFT)
#  define RCC_PLLCFGR_PLLQ_6           (0x2 << RCC_PLLCFGR_PLLQ_SHIFT)
#  define RCC_PLLCFGR_PLLQ_8           (0x3 << RCC_PLLCFGR_PLLQ_SHIFT)
                                                           /* Bits 23: Reserved */
#define RCC_PLLCFGR_PLLREN             (1 << 24)           /* Bit 24: PLL R clock output enable */
#define RCC_PLLCFGR_PLLR_SHIFT         (25)                /* Bits 26-25: Main PLL division factor for PLL R clock (system clock) */
#define RCC_PLLCFGR_PLLR_MASK          (3 << RCC_PLLCFGR_PLLR_SHIFT)
#  define RCC_PLLCFGR_PLLR_2           (0x0 << RCC_PLLCFGR_PLLR_SHIFT)
#  define RCC_PLLCFGR_PLLR_4           (0x1 << RCC_PLLCFGR_PLLR_SHIFT)
#  define RCC_PLLCFGR_PLLR_6           (0x2 << RCC_PLLCFGR_PLLR_SHIFT)
#  define RCC_PLLCFGR_PLLR_8           (0x3 << RCC_PLLCFGR_PLLR_SHIFT)

#define RCC_PLLCFGR_PLLPDIV_SHIFT      (27)                /* Bits 31-27: Main PLL division factor for PLL P clock */
#define RCC_PLLCFGR_PLLPDIV_MASK       (0x1f << RCC_PLLCFGR_PLLPDIV_SHIFT)
#define RCC_PLLCFGR_PLLPDIV(n)         (((n) << RCC_PLLCFGR_PLLPDIV_SHIFT) & RCC_PLLCFGR_PLLPDIV_MASK) /* n=2..31 */

#define RCC_PLLCFGR_RESERVED_MASK      0x008c800c          /* Bits 23, 19-18, 15, and 3-2 should be kept at reset value */
#define RCC_PLLCFGR_RESET              0x00001000

/* CIER - Clock Interrupt Enable Register */

#define RCC_CIER_LSIRDYIE              (1 << 0)
#define RCC_CIER_LSERDYIE              (1 << 1)
#define RCC_CIER_HSIRDYIE              (1 << 3)
#define RCC_CIER_HSERDYIE              (1 << 4)
#define RCC_CIER_PLLRDYIE              (1 << 5)
#define RCC_CIER_LSECSSIE              (1 << 9)
#define RCC_CIER_HSI48RDYIE            (1 << 10)

/* CIFR - Clock Interrupt Flag Register */

#define RCC_CIFR_LSIRDYF               (1 << 0)
#define RCC_CIFR_LSERDYF               (1 << 1)
#define RCC_CIFR_HSIRDYF               (1 << 3)
#define RCC_CIFR_HSERDYF               (1 << 4)
#define RCC_CIFR_PLLRDYF               (1 << 5)
#define RCC_CIFR_CSSF                  (1 << 8)
#define RCC_CIFR_LSECSSF               (1 << 9)
#define RCC_CIFR_HSI48RDYF             (1 << 10)

/* CICR - Clock Interrupt Clear Register */

#define RCC_CICR_LSIRDYC               (1 << 0)
#define RCC_CICR_LSERDYC               (1 << 1)
#define RCC_CICR_HSIRDYC               (1 << 3)
#define RCC_CICR_HSERDYC               (1 << 4)
#define RCC_CICR_PLLRDYC               (1 << 5)
#define RCC_CICR_CSSC                  (1 << 8)
#define RCC_CICR_LSECSSC               (1 << 9)
#define RCC_CICR_HSI48RDYC             (1 << 10)

