apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g4xxxx_rcc.h
/* AHB1RSTR - AHB1 Peripheral Reset Register */

#define RCC_AHB1RSTR_DMA1RST           (1 << 0)
#define RCC_AHB1RSTR_DMA2RST           (1 << 1)
#define RCC_AHB1RSTR_DMAMUX1RST        (1 << 2)
#define RCC_AHB1RSTR_CORDICRST         (1 << 3)
#define RCC_AHB1RSTR_FMACRST           (1 << 4)
#define RCC_AHB1RSTR_FLASHRST          (1 << 8)
#define RCC_AHB1RSTR_CRCRST            (1 << 12)

/* AHB2RSTR - AHB2 Peripheral Reset Register */

#define RCC_AHB2RSTR_GPIOARST          (1 << 0)
#define RCC_AHB2RSTR_GPIOBRST          (1 << 1)
#define RCC_AHB2RSTR_GPIOCRST          (1 << 2)
#define RCC_AHB2RSTR_GPIODRST          (1 << 3)
#define RCC_AHB2RSTR_GPIOERST          (1 << 4)
#define RCC_AHB2RSTR_GPIOFRST          (1 << 5)
#define RCC_AHB2RSTR_GPIOGRST          (1 << 6)
#define RCC_AHB2RSTR_ADC12RST          (1 << 13)
#define RCC_AHB2RSTR_ADC345RST         (1 << 14)
#define RCC_AHB2RSTR_DAC1RST           (1 << 16)
#define RCC_AHB2RSTR_DAC2RST           (1 << 17)
#define RCC_AHB2RSTR_DAC3RST           (1 << 18)
#define RCC_AHB2RSTR_DAC4RST           (1 << 19)
#define RCC_AHB2RSTR_RNGRST            (1 << 26)

/* AHB3RSTR - AHB3 Peripheral Reset Register */

#define RCC_AHB3RSTR_FMCRST            (1 << 0)
#define RCC_AHB3RSTR_QSPIRST           (1 << 8)

/* APB1RSTR1 - APB1 Peripheral Reset Register 1 */

#define RCC_APB1RSTR1_TIM2RST          (1 << 0)
#define RCC_APB1RSTR1_TIM3RST          (1 << 1)
#define RCC_APB1RSTR1_TIM4RST          (1 << 2)
#define RCC_APB1RSTR1_TIM5RST          (1 << 3)
#define RCC_APB1RSTR1_TIM6RST          (1 << 4)
#define RCC_APB1RSTR1_TIM7RST          (1 << 5)
#define RCC_APB1RSTR1_CRSRST           (1 << 8)
#define RCC_APB1RSTR1_SPI2RST          (1 << 14)
#define RCC_APB1RSTR1_SPI3RST          (1 << 15)
#define RCC_APB1RSTR1_USART2RST        (1 << 17)
#define RCC_APB1RSTR1_USART3RST        (1 << 18)
#define RCC_APB1RSTR1_UART4RST         (1 << 19)
#define RCC_APB1RSTR1_UART5RST         (1 << 20)
#define RCC_APB1RSTR1_I2C1RST          (1 << 21)
#define RCC_APB1RSTR1_I2C2RST          (1 << 22)
#define RCC_APB1RSTR1_USBRST           (1 << 23)
#define RCC_APB1RSTR1_FDCANRST         (1 << 25)
#define RCC_APB1RSTR1_PWRRST           (1 << 28)
#define RCC_APB1RSTR1_I2C3RST          (1 << 30)
#define RCC_APB1RSTR1_LPTIM1RST        (1 << 31)

/* APB1RSTR2 - APB1 Peripheral Reset Register 2 */

#define RCC_APB1RSTR2_LPUART1RST       (1 << 0)
#define RCC_APB1RSTR2_I2C4RST          (1 << 1)
#define RCC_APB1RSTR2_UCPD1RST         (1 << 8)

/* APB2RSTR - APB2 Peripheral Reset Register */

#define RCC_APB2RSTR_SYSCFGRST         (1 << 0)
#define RCC_APB2RSTR_TIM1RST           (1 << 11)
#define RCC_APB2RSTR_SPI1RST           (1 << 12)
#define RCC_APB2RSTR_TIM8RST           (1 << 13)
#define RCC_APB2RSTR_USART1RST         (1 << 14)
#define RCC_APB2RSTR_SPI4RST           (1 << 15)
#define RCC_APB2RSTR_TIM15RST          (1 << 16)
#define RCC_APB2RSTR_TIM16RST          (1 << 17)
#define RCC_APB2RSTR_TIM17RST          (1 << 18)
#define RCC_APB2RSTR_TIM20RST          (1 << 20)
#define RCC_APB2RSTR_SAI1RST           (1 << 21)
#define RCC_APB2RSTR_HRTIM1RST         (1 << 26)

/* AHB1ENR - AHB1 Peripheral Clocks Enable Register */

#define RCC_AHB1ENR_DMA1EN             (1 << 0)
#define RCC_AHB1ENR_DMA2EN             (1 << 1)
#define RCC_AHB1ENR_DMAMUX1EN          (1 << 2)
#define RCC_AHB1ENR_CORDICEN           (1 << 3)
#define RCC_AHB1ENR_FMACEN             (1 << 4)
#define RCC_AHB1ENR_FLASHEN            (1 << 8)
#define RCC_AHB1ENR_CRCEN              (1 << 12)

/* AHB2ENR - AHB2 Peripheral Clocks Enable Register */

#define RCC_AHB2ENR_GPIOEN(n)          ((1 << (n)) & 0x7f)
#define RCC_AHB2ENR_GPIOAEN            (1 << 0)
#define RCC_AHB2ENR_GPIOBEN            (1 << 1)
#define RCC_AHB2ENR_GPIOCEN            (1 << 2)
#define RCC_AHB2ENR_GPIODEN            (1 << 3)
#define RCC_AHB2ENR_GPIOEEN            (1 << 4)
#define RCC_AHB2ENR_GPIOFEN            (1 << 5)
#define RCC_AHB2ENR_GPIOGEN            (1 << 6)
#define RCC_AHB2ENR_ADC12EN            (1 << 13)
#define RCC_AHB2ENR_ADC345EN           (1 << 14)
#define RCC_AHB2ENR_DAC1EN             (1 << 16)
#define RCC_AHB2ENR_DAC2EN             (1 << 17)
#define RCC_AHB2ENR_DAC3EN             (1 << 18)
#define RCC_AHB2ENR_DAC4EN             (1 << 19)
#define RCC_AHB2ENR_RNGEN              (1 << 26)

/* AHB3ENR - AHB3 Peripheral Clocks Enable Register */

#define RCC_AHB3ENR_FMCEN              (1 << 0)
#define RCC_AHB3ENR_QSPIEN             (1 << 8)

/* APB1ENR1 - APB1 Peripheral Clocks Enable Register 1 */

#define RCC_APB1ENR1_TIM2EN            (1 << 0)
#define RCC_APB1ENR1_TIM3EN            (1 << 1)
#define RCC_APB1ENR1_TIM4EN            (1 << 2)
#define RCC_APB1ENR1_TIM5EN            (1 << 3)
#define RCC_APB1ENR1_TIM6EN            (1 << 4)
#define RCC_APB1ENR1_TIM7EN            (1 << 5)
#define RCC_APB1ENR1_CRSEN             (1 << 8)
#define RCC_APB1ENR1_RTCAPBEN          (1 << 10)
#define RCC_APB1ENR1_WWDGEN            (1 << 11)
#define RCC_APB1ENR1_SPI2EN            (1 << 14)
#define RCC_APB1ENR1_SPI3EN            (1 << 15)
#define RCC_APB1ENR1_USART2EN          (1 << 17)
#define RCC_APB1ENR1_USART3EN          (1 << 18)
#define RCC_APB1ENR1_UART4EN           (1 << 19)
#define RCC_APB1ENR1_UART5EN           (1 << 20)
#define RCC_APB1ENR1_I2C1EN            (1 << 21)
#define RCC_APB1ENR1_I2C2EN            (1 << 22)
#define RCC_APB1ENR1_USBEN             (1 << 23)
#define RCC_APB1ENR1_FDCANEN           (1 << 25)
#define RCC_APB1ENR1_PWREN             (1 << 28)
#define RCC_APB1ENR1_I2C3EN            (1 << 30)
#define RCC_APB1ENR1_LPTIM1EN          (1 << 31)

/* APB1ENR2 - APB1 Peripheral Clocks Enable Register 2 */

#define RCC_APB1ENR2_LPUART1EN         (1 << 0)
#define RCC_APB1ENR2_I2C4EN            (1 << 1)
#define RCC_APB1ENR2_UCPD1EN           (1 << 8)

/* APB2ENR - APB2 Peripheral Clocks Enable Register */

#define RCC_APB2ENR_SYSCFGEN           (1 << 0)
#define RCC_APB2ENR_TIM1EN             (1 << 11)
#define RCC_APB2ENR_SPI1EN             (1 << 12)
#define RCC_APB2ENR_TIM8EN             (1 << 13)
#define RCC_APB2ENR_USART1EN           (1 << 14)
#define RCC_APB2ENR_SPI4EN             (1 << 15)
#define RCC_APB2ENR_TIM15EN            (1 << 16)
#define RCC_APB2ENR_TIM16EN            (1 << 17)
#define RCC_APB2ENR_TIM17EN            (1 << 18)
#define RCC_APB2ENR_TIM20EN            (1 << 20)
#define RCC_APB2ENR_SAI1EN             (1 << 21)
#define RCC_APB2ENR_HRTIM1EN           (1 << 26)

/* AHB1SMENR - AHB1 Peripheral Clocks Enable In Sleep/Stop Mode Register */

#define RCC_AHB1SMENR_DMA1SMEN         (1 << 0)
#define RCC_AHB1SMENR_DMA2SMEN         (1 << 1)
#define RCC_AHB1SMENR_DMAMUX1SMEN      (1 << 2)
#define RCC_AHB1SMENR_CORDICSMEN       (1 << 3)
#define RCC_AHB1SMENR_FMACSMEN         (1 << 4)
#define RCC_AHB1SMENR_FLASHSMEN        (1 << 8)
#define RCC_AHB1SMENR_SRAM1SMEN        (1 << 9)
#define RCC_AHB1SMENR_CRCSMEN          (1 << 12)

/* AHB2SMENR - AHB2 Peripheral Clocks Enable In Sleep/Stop Mode Register */

#define RCC_AHB2SMENR_GPIOASMEN        (1 << 0)
#define RCC_AHB2SMENR_GPIOBSMEN        (1 << 1)
#define RCC_AHB2SMENR_GPIOCSMEN        (1 << 2)
#define RCC_AHB2SMENR_GPIODSMEN        (1 << 3)
#define RCC_AHB2SMENR_GPIOESMEN        (1 << 4)
#define RCC_AHB2SMENR_GPIOFSMEN        (1 << 5)
#define RCC_AHB2SMENR_GPIOGSMEN        (1 << 6)
#define RCC_AHB2SMENR_CCMSRAMSMEN      (1 << 9)
#define RCC_AHB2SMENR_SRAM2SMEN        (1 << 10)
#define RCC_AHB2SMENR_ADC12SMEN        (1 << 13)
#define RCC_AHB2SMENR_ADC345SMEN       (1 << 14)
#define RCC_AHB2SMENR_DAC1SMEN         (1 << 16)
#define RCC_AHB2SMENR_DAC2SMEN         (1 << 17)
#define RCC_AHB2SMENR_DAC3SMEN         (1 << 18)
#define RCC_AHB2SMENR_DAC4SMEN         (1 << 19)
#define RCC_AHB2SMENR_RNGSMEN          (1 << 26)

/* AHB3SMENR - AHB3 Peripheral Clocks Enable In Sleep/Stop Mode Register */

#define RCC_AHB3SMENR_FMCSMEN          (1 << 0)
#define RCC_AHB3SMENR_QSPISMEN         (1 << 8)

/* APB1SMENR1 - APB1 Peripheral Clocks Enable In Sleep/Stop Mode Register 1 */

#define RCC_APB1SMENR1_TIM2SMEN        (1 << 0)
#define RCC_APB1SMENR1_TIM3SMEN        (1 << 1)
#define RCC_APB1SMENR1_TIM4SMEN        (1 << 2)
#define RCC_APB1SMENR1_TIM5SMEN        (1 << 3)
#define RCC_APB1SMENR1_TIM6SMEN        (1 << 4)
#define RCC_APB1SMENR1_TIM7SMEN        (1 << 5)
#define RCC_APB1SMENR1_CRSSMEN         (1 << 8)
#define RCC_APB1SMENR1_RTCAPBSMEN      (1 << 10)
#define RCC_APB1SMENR1_WWDGSMEN        (1 << 11)
#define RCC_APB1SMENR1_SPI2SMEN        (1 << 14)
#define RCC_APB1SMENR1_SPI3SMEN        (1 << 15)
#define RCC_APB1SMENR1_USART2SMEN      (1 << 17)
#define RCC_APB1SMENR1_USART3SMEN      (1 << 18)
#define RCC_APB1SMENR1_UART4SMEN       (1 << 19)
#define RCC_APB1SMENR1_UART5SMEN       (1 << 20)
#define RCC_APB1SMENR1_I2C1SMEN        (1 << 21)
#define RCC_APB1SMENR1_I2C2SMEN        (1 << 22)
#define RCC_APB1SMENR1_USBSMEN         (1 << 23)
#define RCC_APB1SMENR1_FDCANSMEN       (1 << 25)
#define RCC_APB1SMENR1_PWRSMEN         (1 << 28)
#define RCC_APB1SMENR1_I2C3SMEN        (1 << 30)
#define RCC_APB1SMENR1_LPTIM1SMEN      (1 << 31)

