apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g4xxxx_rcc.h
/* APB1SMENR2 - APB1 Peripheral Clocks Enable In Sleep/Stop Mode Register 2 */

#define RCC_APB1SMENR2_LPUART1SMEN     (1 << 0)
#define RCC_APB1SMENR2_I2C4SMEN        (1 << 1)
#define RCC_APB1SMENR2_UCPD1SMEN       (1 << 8)

/* APB2SMENR - APB2 Peripheral Clocks Enable In Sleep/Stop Mode Register */

#define RCC_APB2SMENR_SYSCFGSMEN       (1 << 0)
#define RCC_APB2SMENR_TIM1SMEN         (1 << 11)
#define RCC_APB2SMENR_SPI1SMEN         (1 << 12)
#define RCC_APB2SMENR_TIM8SMEN         (1 << 13)
#define RCC_APB2SMENR_USART1SMEN       (1 << 14)
#define RCC_APB2SMENR_SPI4SMEN         (1 << 15)
#define RCC_APB2SMENR_TIM15SMEN        (1 << 16)
#define RCC_APB2SMENR_TIM16SMEN        (1 << 17)
#define RCC_APB2SMENR_TIM17SMEN        (1 << 18)
#define RCC_APB2SMENR_TIM20SMEN        (1 << 20)
#define RCC_APB2SMENR_SAI1SMEN         (1 << 21)
#define RCC_APB2SMENR_HRTIM1SMEN       (1 << 26)

/* CCIPR - Peripherals Independent Clock Configuration Register */

#define RCC_CCIPR_USART1SEL_SHIFT      (0)
#define RCC_CCIPR_USART1SEL_MASK       (3 << RCC_CCIPR_USART1SEL_SHIFT)
#  define RCC_CCIPR_USART1SEL_PCLK     (0 << RCC_CCIPR_USART1SEL_SHIFT)
#  define RCC_CCIPR_USART1SEL_SYSCLK   (1 << RCC_CCIPR_USART1SEL_SHIFT)
#  define RCC_CCIPR_USART1SEL_HSI16    (2 << RCC_CCIPR_USART1SEL_SHIFT)
#  define RCC_CCIPR_USART1SEL_LSE      (3 << RCC_CCIPR_USART1SEL_SHIFT)

#define RCC_CCIPR_USART2SEL_SHIFT      (2)
#define RCC_CCIPR_USART2SEL_MASK       (3 << RCC_CCIPR_USART2SEL_SHIFT)
#  define RCC_CCIPR_USART2SEL_PCLK     (0 << RCC_CCIPR_USART2SEL_SHIFT)
#  define RCC_CCIPR_USART2SEL_SYSCLK   (1 << RCC_CCIPR_USART2SEL_SHIFT)
#  define RCC_CCIPR_USART2SEL_HSI16    (2 << RCC_CCIPR_USART2SEL_SHIFT)
#  define RCC_CCIPR_USART2SEL_LSE      (3 << RCC_CCIPR_USART2SEL_SHIFT)

#define RCC_CCIPR_USART3SEL_SHIFT      (4)
#define RCC_CCIPR_USART3SEL_MASK       (3 << RCC_CCIPR_USART3SEL_SHIFT)
#  define RCC_CCIPR_USART3SEL_PCLK     (0 << RCC_CCIPR_USART3SEL_SHIFT)
#  define RCC_CCIPR_USART3SEL_SYSCLK   (1 << RCC_CCIPR_USART3SEL_SHIFT)
#  define RCC_CCIPR_USART3SEL_HSI16    (2 << RCC_CCIPR_USART3SEL_SHIFT)
#  define RCC_CCIPR_USART3SEL_LSE      (3 << RCC_CCIPR_USART3SEL_SHIFT)

#define RCC_CCIPR_UART4SEL_SHIFT       (6)
#define RCC_CCIPR_UART4SEL_MASK        (3 << RCC_CCIPR_UART4SEL_SHIFT)
#  define RCC_CCIPR_UART4SEL_PCLK      (0 << RCC_CCIPR_UART4SEL_SHIFT)
#  define RCC_CCIPR_UART4SEL_SYSCLK    (1 << RCC_CCIPR_UART4SEL_SHIFT)
#  define RCC_CCIPR_UART4SEL_HSI16     (2 << RCC_CCIPR_UART4SEL_SHIFT)
#  define RCC_CCIPR_UART4SEL_LSE       (3 << RCC_CCIPR_UART4SEL_SHIFT)

#define RCC_CCIPR_UART5SEL_SHIFT       (8)
#define RCC_CCIPR_UART5SEL_MASK        (3 << RCC_CCIPR_UART5SEL_SHIFT)
#  define RCC_CCIPR_UART5SEL_PCLK      (0 << RCC_CCIPR_UART5SEL_SHIFT)
#  define RCC_CCIPR_UART5SEL_SYSCLK    (1 << RCC_CCIPR_UART5SEL_SHIFT)
#  define RCC_CCIPR_UART5SEL_HSI16     (2 << RCC_CCIPR_UART5SEL_SHIFT)
#  define RCC_CCIPR_UART5SEL_LSE       (3 << RCC_CCIPR_UART5SEL_SHIFT)

#define RCC_CCIPR_LPUART1SEL_SHIFT     (10)
#define RCC_CCIPR_LPUART1SEL_MASK      (3 << RCC_CCIPR_LPUART1SEL_SHIFT)
#  define RCC_CCIPR_LPUART1SEL_PCLK    (0 << RCC_CCIPR_LPUART1SEL_SHIFT)
#  define RCC_CCIPR_LPUART1SEL_SYSCLK  (1 << RCC_CCIPR_LPUART1SEL_SHIFT)
#  define RCC_CCIPR_LPUART1SEL_HSI16   (2 << RCC_CCIPR_LPUART1SEL_SHIFT)
#  define RCC_CCIPR_LPUART1SEL_LSE     (3 << RCC_CCIPR_LPUART1SEL_SHIFT)

#define RCC_CCIPR_I2C1SEL_SHIFT        (12)
#define RCC_CCIPR_I2C1SEL_MASK         (3 << RCC_CCIPR_I2C1SEL_SHIFT)
#  define RCC_CCIPR_I2C1SEL_PCLK       (0 << RCC_CCIPR_I2C1SEL_SHIFT)
#  define RCC_CCIPR_I2C1SEL_SYSCLK     (1 << RCC_CCIPR_I2C1SEL_SHIFT)
#  define RCC_CCIPR_I2C1SEL_HSI16      (2 << RCC_CCIPR_I2C1SEL_SHIFT)

#define RCC_CCIPR_I2C2SEL_SHIFT        (14)
#define RCC_CCIPR_I2C2SEL_MASK         (3 << RCC_CCIPR_I2C2SEL_SHIFT)
#  define RCC_CCIPR_I2C2SEL_PCLK       (0 << RCC_CCIPR_I2C2SEL_SHIFT)
#  define RCC_CCIPR_I2C2SEL_SYSCLK     (1 << RCC_CCIPR_I2C2SEL_SHIFT)
#  define RCC_CCIPR_I2C2SEL_HSI16      (2 << RCC_CCIPR_I2C2SEL_SHIFT)

#define RCC_CCIPR_I2C3SEL_SHIFT        (16)
#define RCC_CCIPR_I2C3SEL_MASK         (3 << RCC_CCIPR_I2C3SEL_SHIFT)
#  define RCC_CCIPR_I2C3SEL_PCLK       (0 << RCC_CCIPR_I2C3SEL_SHIFT)
#  define RCC_CCIPR_I2C3SEL_SYSCLK     (1 << RCC_CCIPR_I2C3SEL_SHIFT)
#  define RCC_CCIPR_I2C3SEL_HSI16      (2 << RCC_CCIPR_I2C3SEL_SHIFT)

#define RCC_CCIPR_LPTIM1SEL_SHIFT      (18)
#define RCC_CCIPR_LPTIM1SEL_MASK       (3 << RCC_CCIPR_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR_LPTIM1SEL_PCLK     (0 << RCC_CCIPR_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR_LPTIM1SEL_SYSCLK   (1 << RCC_CCIPR_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR_LPTIM1SEL_HSI16    (2 << RCC_CCIPR_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR_LPTIM1SEL_LSE      (3 << RCC_CCIPR_LPTIM1SEL_SHIFT)

#define RCC_CCIPR_SAI1SEL_SHIFT        (20)
#define RCC_CCIPR_SAI1SEL_MASK         (3 << RCC_CCIPR_SAI1SEL_SHIFT)
#  define RCC_CCIPR_SAI1SEL_SYSCLK     (0 << RCC_CCIPR_SAI1SEL_SHIFT)
#  define RCC_CCIPR_SAI1SEL_PLLQ       (1 << RCC_CCIPR_SAI1SEL_SHIFT)
#  define RCC_CCIPR_SAI1SEL_I2S_CKIN   (2 << RCC_CCIPR_SAI1SEL_SHIFT)
#  define RCC_CCIPR_SAI1SEL_HSI16      (3 << RCC_CCIPR_SAI1SEL_SHIFT)

#define RCC_CCIPR_I2S23SEL_SHIFT       (22)
#define RCC_CCIPR_I2S23SEL_MASK        (3 << RCC_CCIPR_I2S23SEL_SHIFT)
#  define RCC_CCIPR_I2S23SEL_SYSCLK    (0 << RCC_CCIPR_I2S23SEL_SHIFT)
#  define RCC_CCIPR_I2S23SEL_PLLQ      (1 << RCC_CCIPR_I2S23SEL_SHIFT)
#  define RCC_CCIPR_I2S23SEL_I2S_CKIN  (2 << RCC_CCIPR_I2S23SEL_SHIFT)
#  define RCC_CCIPR_I2S23SEL_HSI16     (3 << RCC_CCIPR_I2S23SEL_SHIFT)

#define RCC_CCIPR_FDCANSEL_SHIFT       (24)
#define RCC_CCIPR_FDCANSEL_MASK        (3 << RCC_CCIPR_FDCANSEL_SHIFT)
#  define RCC_CCIPR_FDCANSEL_HSE       (0 << RCC_CCIPR_FDCANSEL_SHIFT)
#  define RCC_CCIPR_FDCANSEL_PLLQ      (1 << RCC_CCIPR_FDCANSEL_SHIFT)
#  define RCC_CCIPR_FDCANSEL_PCLK      (2 << RCC_CCIPR_FDCANSEL_SHIFT)

#define RCC_CCIPR_CLK48SEL_SHIFT       (26)
#define RCC_CCIPR_CLK48SEL_MASK        (3 << RCC_CCIPR_CLK48SEL_SHIFT)
#  define RCC_CCIPR_CLK48SEL_HSI48     (0 << RCC_CCIPR_CLK48SEL_SHIFT)
#  define RCC_CCIPR_CLK48SEL_PLLQ      (2 << RCC_CCIPR_CLK48SEL_SHIFT)

#define RCC_CCIPR_ADC12SEL_SHIFT       (28)
#define RCC_CCIPR_ADC12SEL_MASK        (3 << RCC_CCIPR_ADC12SEL_SHIFT)
#  define RCC_CCIPR_ADC12SEL_NO_CLK    (0 << RCC_CCIPR_ADC12SEL_SHIFT)
#  define RCC_CCIPR_ADC12SEL_PLLP      (1 << RCC_CCIPR_ADC12SEL_SHIFT)
#  define RCC_CCIPR_ADC12SEL_SYSCLK    (2 << RCC_CCIPR_ADC12SEL_SHIFT)

#define RCC_CCIPR_ADC345SEL_SHIFT      (30)
#define RCC_CCIPR_ADC345SEL_MASK       (3 << RCC_CCIPR_ADC345SEL_SHIFT)
#  define RCC_CCIPR_ADC345SEL_NO_CLK   (0 << RCC_CCIPR_ADC345SEL_SHIFT)
#  define RCC_CCIPR_ADC345SEL_PLLP     (1 << RCC_CCIPR_ADC345SEL_SHIFT)
#  define RCC_CCIPR_ADC345SEL_SYSCLK   (2 << RCC_CCIPR_ADC345SEL_SHIFT)

