apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g4xxxx_rcc.h
/* BDCR - Backup Domain Control Register */

#define RCC_BDCR_LSEON                 (1 << 0)
#define RCC_BDCR_LSERDY                (1 << 1)
#define RCC_BDCR_LSEBYP                (1 << 2)

#define RCC_BDCR_LSEDRV_SHIFT          (3)
#define RCC_BDCR_LSEDRV_MASK           (3 << RCC_BDCR_LSEDRV_SHIFT)
#  define RCC_BDCR_LSEDRV_LOW          (0 << RCC_BDCR_LSEDRV_SHIFT)
#  define RCC_BDCR_LSEDRV_MEDIUM_LOW   (1 << RCC_BDCR_LSEDRV_SHIFT)
#  define RCC_BDCR_LSEDRV_MEDIUM_HIGH  (2 << RCC_BDCR_LSEDRV_SHIFT)
#  define RCC_BDCR_LSEDRV_HIGH         (3 << RCC_BDCR_LSEDRV_SHIFT)

#define RCC_BDCR_LSECSSON              (1 << 5)
#define RCC_BDCR_LSECSSD               (1 << 6)

#define RCC_BDCR_RTCSEL_SHIFT          (8)
#define RCC_BDCR_RTCSEL_MASK           (3 << RCC_BDCR_RTCSEL_SHIFT)
#  define RCC_BDCR_RTCSEL_NO_CLK       (0 << RCC_BDCR_RTCSEL_SHIFT)
#  define RCC_BDCR_RTCSEL_LSE          (1 << RCC_BDCR_RTCSEL_SHIFT)
#  define RCC_BDCR_RTCSEL_LSI          (2 << RCC_BDCR_RTCSEL_SHIFT)
#  define RCC_BDCR_RTCSEL_HSE          (3 << RCC_BDCR_RTCSEL_SHIFT)

#define RCC_BDCR_RTCEN                 (1 << 15)
#define RCC_BDCR_BDRST                 (1 << 16)
#define RCC_BDCR_LSCOEN                (1 << 24)
#define RCC_BDCR_LSCOSEL               (1 << 25)

/* CSR - Clock Control & Status Register */

#define RCC_CSR_LSION                  (1 << 0)
#define RCC_CSR_LSIRDY                 (1 << 1)
#define RCC_CSR_RMVF                   (1 << 23)
#define RCC_CSR_OBLRSTF                (1 << 25)
#define RCC_CSR_PINRSTF                (1 << 26)
#define RCC_CSR_BORRSTF                (1 << 27)
#define RCC_CSR_SFTRSTF                (1 << 28)
#define RCC_CSR_IWDGRSTF               (1 << 29)
#define RCC_CSR_WWDGRSTF               (1 << 30)
#define RCC_CSR_LPWRRSTF               (1 << 31)

/* CRRCR - Clock Recovery RC Register */

#define RCC_CRRCR_HSI48ON              (1 << 0)
#define RCC_CRRCR_HSI48RDY             (1 << 1)

#define RCC_CRRCR_HSI48CAL_SHIFT       (7)
#define RCC_CRRCR_HSI48CAL_MASK        (0x1ff << RCC_CRRCR_HSI48CAL_SHIFT)
#define RCC_CRRCR_HSI48CAL(n)          (((n) << RCC_CRRCR_HSI48CAL_SHIFT) & RCC_CRRCR_HSI48CAL_MASK)

/* CCIPR2 - Peripherals Independent Clock Configuration Register 2 */

#define RCC_CCIPR2_I2C4SEL_SHIFT       (0)
#define RCC_CCIPR2_I2C4SEL_MASK        (3 << RCC_CCIPR2_I2C4SEL_SHIFT)
#define RCC_CCIPR2_I2C4SEL_PCLK        (0 << RCC_CCIPR2_I2C4SEL_SHIFT)
#define RCC_CCIPR2_I2C4SEL_SYSCLK      (1 << RCC_CCIPR2_I2C4SEL_SHIFT)
#define RCC_CCIPR2_I2C4SEL_HSI16       (2 << RCC_CCIPR2_I2C4SEL_SHIFT)

#define RCC_CCIPR2_QSPISEL_SHIFT       (20)
#define RCC_CCIPR2_QSPISEL_MASK        (3 << RCC_CCIPR2_QSPISEL_SHIFT)
#define RCC_CCIPR2_QSPISEL_SYSCLK      (0 << RCC_CCIPR2_QSPISEL_SHIFT)
#define RCC_CCIPR2_QSPISEL_HSI16       (1 << RCC_CCIPR2_QSPISEL_SHIFT)
#define RCC_CCIPR2_QSPISEL_PLLQ        (2 << RCC_CCIPR2_QSPISEL_SHIFT)

/* Compatibility definitions ************************************************/

/* Compatibility with F1/F2/F4 Status Register names */

#define STM32_RCC_APB1ENR_OFFSET       STM32_RCC_APB1ENR1_OFFSET
#define STM32_RCC_APB1ENR              STM32_RCC_APB1ENR1

#define STM32_RCC_APB1RSTR_OFFSET      STM32_RCC_APB1RSTR1_OFFSET
#define STM32_RCC_APB1RSTR             STM32_RCC_APB1RSTR1

#define RCC_APB1ENR_USART2EN           RCC_APB1ENR1_USART2EN
#define RCC_APB1ENR_USART3EN           RCC_APB1ENR1_USART3EN
#define RCC_APB1ENR_UART4EN            RCC_APB1ENR1_UART4EN
#define RCC_APB1ENR_UART5EN            RCC_APB1ENR1_UART5EN

#define RCC_APB1ENR_I2C1EN             RCC_APB1ENR1_I2C1EN
#define RCC_APB1ENR_I2C2EN             RCC_APB1ENR1_I2C2EN

#define RCC_APB1RSTR_I2C1RST           RCC_APB1RSTR1_I2C1RST
#define RCC_APB1RSTR_I2C2RST           RCC_APB1RSTR1_I2C2RST

#define RCC_APB1ENR_TIM2EN             RCC_APB1ENR1_TIM2EN
#define RCC_APB1ENR_TIM3EN             RCC_APB1ENR1_TIM3EN
#define RCC_APB1ENR_TIM4EN             RCC_APB1ENR1_TIM4EN
#define RCC_APB1ENR_TIM5EN             RCC_APB1ENR1_TIM5EN

#endif /* __ARCH_ARM_SRC_STM32_HARDWARE_STM32G4XXXX_RCC_H */
